app/controllers/movies_controller.rb

  def index

    #Pulls Any Unique Value of Rating from Movie Database:
    @all_ratings = Movie.uniq.pluck(:rating)

    #Finds non-Nil Value for Field if it Exists from Current/Last Session:
    sort_field = params[:field] || session[:field]

    #Discovers Which Column to Hilight with CSS Code and
    #Saves Field from Current Session (params) to Session:
    session[:hilite] = params[:field] || session[:field]
    session[:field] = params[:field] || session[:field]

    #If Page Not Reset and Session Has a Direction then Flip Direction:
    if(params[:commit] != "Refresh")
        session[:direct] == :desc ? session[:direct] = :asc : session[:direct] = :desc
    end

    #Put Direction (if it exists in session) In a Local Variable - Default Descending:
    sort_direct = session[:direct] || :desc

    #Opens a Temporary Hash to Solve Three Condition Scenario of:
    #    - params[:ratings] nil, session[:ratings] nil
#   #    - params[:ratings] nil, session[:ratings] has values
#   #    - params[:ratings] has values

    ratingsHash = {}
    ratingsHash[:ratings] = params[:ratings] || session[:ratings] || Hash[@all_ratings.map { |x| [x,x]}]
---
SELECT DISTINCT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG','PG-13','R')) ORDER BY release_date DESC